Repository: vishvaa-vsk/HarvestHub
Catalog: lib/l10n/app_*.arb
Languages: ml, ta, te

# appTitle
source: HarvestHub
ml: ഹാർവെസ്റ്റ് ഹബ്
ta: ஹார்வெஸ்ட்ஹப்
te: హార్వెస్ట్ హబ్

# welcomeMessage
source: Welcome to HarvestHub!
ml: HarvestHub-ലേക്ക് സ്വാഗതം!
ta: ஹார்வெஸ்ட்ஹப்-க்கு வரவேற்கிறோம்!
te: హార్వెస్ట్ హబ్‌కు స్వాగతం!

source: Select Language
ml: ഇഷ്ടപ്പെട്ട ഭാഷ തിരഞ്ഞെടുക്കുക
ta: விருப்பமான மொழியைத் தேர்ந்தெடுக்கவும்
te: ఇష్టమైన భాషను ఎంచుకోండి

source: English
ml: ഇംഗ്ലീഷ്
ta: ஆங்கிலம்
te: ఆంగ్లం

source: Hindi
ml: ഹിന്ദി
ta: இந்தி
te: హిందీ

source: Tamil
ml: തമിഴ്
ta: தமிழ்
te: తమిళం

source: Telugu
ml: തെലുങ്ക്
ta: தெலுங்கு
te: తెలుగు

source: Malayalam
ml: മലയാളം
ta: மலையாளம்
te: మలయాళం

source: Home
ml: ഹോം
ta: முகப்பு
te: హోమ్

source: HarvestBot
ta: ஹார்வெஸ்ட்பாட்
te: హార్వెస్ట్ బాట్

source: Pest Detection
ml: കീടനിയന്ത്രണം
ta: பூச்சி கண்டறிதல்
te: పురుగుల గుర్తింపు

source: Community
ml: സമൂഹം
ta: சமூகம்
te: సమూహం

source: Your farming companion
ml: നിങ്ങളുടെ കൃഷി കൂട്ടുകാരൻ
ta: உங்கள் விவசாய நண்பன்
te: మీ కృషి సహచరుడు

source: Edit Profile Settings
ml: പ്രൊഫൈൽ ക്രമീകരണങ്ങൾ എഡിറ്റ് ചെയ്യുക
ta: சுயவிவர அமைப்புகளைத் திருத்தவும்
te: ప్రొఫైల్ సెట్టింగ్స్ ఎడిట్ చేయండి

source: Logout
ml: ലോഗ് ഔട്ട്
ta: லாக்அவுட்
te: లాగ్ అవుట్

source: Error loading user data
ml: ഉപയോക്തൃ ഡാറ്റ ലോഡ് ചെയ്യുന്നതിൽ പിഴവ്
ta: பயனர் தரவுகளை ஏற்றுவதில் பிழை
te: ఉపయోగదారు డేటా లోడ్ చేయడంలో పొరపాటు

source: Weather Forecast
ml: കാലാവസ്ഥാ പ്രവചനങ്ങൾ
ta: காலநிலை முன்னறிவிப்பு
te: వాతావరణ అంచనాలు

# feelsLike
source: Feels Like: {value}Â°C
ml: അനുഭവപ്പെടുന്നത്: {value}°C
ta: உணர்வு: {value}°C
te: అనుభవం: {value}°C

# wind
source: Wind: {speed} km/h ({dir})
ml: കാറ്റ്: {speed} കിമീ/മണിക്കൂർ ({dir})
ta: காற்று: {speed} கிமீ/மணிநேரம் ({dir})
te: గాలి: {speed} కిమీ/గంట ({dir})

# pressure
source: Pressure: {value} mb
ml: മർദ്ദം: {value} mb
ta: அழுத்தம்: {value} mb
te: ఒత్తిడి: {value} mb

# humidity
source: Humidity: {value}%
ml: ആർദ്രത: {value}%
ta: ஈரப்பதம்: {value}%
te: ఆర్ద్రత: {value}%

# visibility
source: Visibility: {value} km
ml: ദൃശ്യതാ ദൂരം: {value} കിമീ
ta: தெளிவுத்தன்மை: {value} கிமீ
te: దృశ్యత: {value} కిమీ

# uvIndex
source: UV Index: {value}
ml: UV സൂചിക: {value}
ta: UV குறியீடு: {value}
te: UV సూచిక: {value}

# cloudCover
source: Cloud Cover: {value}%
ml: മേഘാവരണം: {value}%
ta: மேகக் கவர்: {value}%
te: మేఘ కవర్: {value}%

# threeDayForecast
source: 3-Day Forecast
ml: 3-ദിവസ പ്രവചനങ്ങൾ
ta: 3-நாள் முன்னறிவிப்பு
te: 3-రోజుల అంచనాలు

# thirtyDayForecast
source: 30-Day Forecast
ml: 30-ദിവസ പ്രവചനങ്ങൾ
ta: 30-நாள் முன்னறிவிப்பு
te: 30-రోజుల అంచనాలు

# weatherForecastCalendar
source: Weather Forecast
ml: കാലാവസ്ഥാ പ്രവചനം: {startDate} - {endDate}
ta: காலநிலை முன்னறிவிப்பு: {startDate} - {endDate}
te: వాతావరణ అంచనాలు: {startDate} - {endDate}

source: View More
ml: കൂടുതൽ കാണുക
ta: மேலும் காண்க
te: మరింత చూడండి

# failedToLoadWeather
source: Failed to load weather data
ml: കാലാവസ്ഥാ ഡാറ്റ ലോഡ് ചെയ്യുന്നതിൽ പരാജയം
ta: காலநிலை தரவுகளை ஏற்றுவதில் தோல்வி
te: వాతావరణ డేటా లోడ్ చేయడంలో విఫలమైంది

source: Farming Tip
ml: കൃഷി ടിപ്പ്
ta: விவசாய குறிப்புகள்
te: కృషి సూచన

# noFarmingTip
source: No farming tip available
ml: കൃഷി ടിപ്പ് ലഭ്യമല്ല
ta: குறிப்பு கிடைக்கவில்லை
te: కృషి సూచన అందుబాటులో లేదు

source: Recommended Crop
ml: ശുപാർശ ചെയ്ത വിള
ta: பரிந்துரைக்கப்பட்ட பயிர்
te: సిఫారసు చేసిన పంట

# noCropRecommendation
source: No crop recommendation available
ml: വിള ശുപാർശ ലഭ്യമല്ല
ta: பயிர் பரிந்துரை இல்லை
te: పంట సిఫారసు అందుబాటులో లేదు

# locationServicesRequired
source: Location services are required to use this app.
ml: ഈ ആപ്പ് ഉപയോഗിക്കാൻ സ്ഥാന സേവനങ്ങൾ ആവശ്യമാണ്.
ta: இப்பயன்பாட்டைப் பயன்படுத்த இடம் சேவைகள் தேவை.
te: ఈ యాప్‌ను ఉపయోగించడానికి స్థానం సేవలు అవసరం.

source: Failed to load insights
ml: ഉൾക്കാഴ്ചകൾ ലോഡ് ചെയ്യുന്നതിൽ പരാജയപ്പെട്ടു
ta: நுண்ணறிவுகளை ஏற்றுவதில் தோல்வி
te: అంతర్దృష్టులను లోడ్ చేయడంలో విఫలమైంది

source: Send OTP
ml: OTP അയക്കുക
ta: OTP அனுப்பவும்
te: OTP పంపండి

source: Verify OTP
ml: OTP സ്ഥിരീകരിക്കുക
ta: OTP சரிபார்க்கவும்
te: OTP ధృవీకరించండి

source: Name
ml: പേര്
ta: பெயர்
te: పేరు

source: Phone Number
ml: ഫോൺ നമ്പർ
ta: தொலைபேசி எண்
te: ఫోన్ నంబర్

source: Enter OTP
ml: OTP നൽകുക
ta: OTP உள்ளிடவும்
te: OTP నమోదు చేయండి

# pleaseEnterNameAndPhone
source: Please enter your name and phone number
ml: ദയവായി നിങ്ങളുടെ പേര് മറ്റും ഫോൺ നമ്പർ നൽകുക
ta: தயவுசெய்து உங்கள் பெயர் மற்றும் தொலைபேசி எண்ணை உள்ளிடவும்
te: దయచేసి మీ పేరు మరియు ఫోన్ నంబర్ నమోదు చేయండి

source: Invalid OTP
ml: അസാധുവായ OTP
ta: தவறான OTP
te: చెల్లని OTP

# failedToSendOTP
source: Failed to send OTP. Please try again.
ml: OTP അയക്കുന്നതിൽ പരാജയം. ദയവായി വീണ്ടും ശ്രമിക്കുക.
ta: OTP அனுப்புவதில் தோல்வி. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.
te: OTP పంపడంలో విఫలమైంది. దయచేసి మళ్లీ ప్రయత్నించండి.

source: Failed to sign in
ml: സൈൻ ഇൻ ചെയ്യുന്നതിൽ പരാജയം
ta: உள்நுழைவதில் தோல்வி
te: సైన్ ఇన్ చేయడంలో విఫలమైంది

source: Enable Location Services
ml: സ്ഥാന സേവനങ്ങൾ സജീവമാക്കുക
ta: இடம் சேவைகளை இயக்கவும்
te: స్థానం సేవలను ప్రారంభించండి

source: Open Settings
ml: ക്രമീകരണങ്ങൾ തുറക്കുക
ta: அமைப்புகளை திறக்கவும்
te: సెట్టింగ్స్ తెరవండి

source: Cancel
ml: റദ്ദാക്കുക
ta: ரத்து செய்
te: రద్దు చేయండి

# nextContinue
source: CONTINUE
ml: തുടരുക
ta: தொடர்க
te: కొనసాగించు

source: PROCEED
ml: മുന്നോട്ട് പോകുക
ta: முன்னேறு
te: ముందుకు సాగండి

source: Change Language
ml: ഭാഷ മാറ്റുക
ta: மொழி மாற்றவும்
te: భాష మార్చండి

source: Talk to HarvestBot
ml: HarvestBot-നോട് സംസാരിക്കുക
ta: ஹார்வெஸ்ட்பாட்-க்கு பேசுங்கள்
te: హార్వెస్ట్ బాట్‌తో మాట్లాడండి

source: Create Post
ml: പോസ്റ്റ് സൃഷ്ടിക്കുക
ta: இடுகை உருவாக்க
te: పోస్ట్ సృష్టించండి

# addComment
source: Add a comment...
ml: അഭിപ്രായം ചേർക്കുക...
ta: கருத்து சேர்க்க...
te: వ్యాఖ్య జోడించండి...

source: Post
ml: പോസ്റ്റ്
ta: இடுகை
te: పోస్ట్

source: No posts yet.
ml: ഇതുവരെ പോസ്റ്റുകളൊന്നുമില്ല.
ta: இன்னும் இடுகைகள் இல்லை.
te: ఇంకా పోస్ట్‌లు లేవు.

source: What's on your mind?
ml: നിങ്ങളുടെ മനസ്സിൽ എന്താണ്?
ta: உங்கள் மனதில் என்ன?
te: మీ మనసులో ఏమిటి?

source: Current Weather
ml: നിലവിലെ കാലാവസ്ഥ
ta: தற்போதைய காலநிலை
te: ప్రస్తుత వాతావరణం

source: Upcoming Forecast
ml: വരാനിരിക്കുന്ന പ്രവചനം
ta: வரவிருக்கும் முன்னறிவிப்பு
te: రాబోయే అంచనాలు

source: Tomorrow
ml: നാളെ
ta: நாளை
te: రేపు

# minTemperature
source: Min:
ml: ഏറ്റവും കുറഞ്ഞത്:
ta: குறை:
te: కనిష్ట:

source: Rain
ml: മഴ
ta: மழை
te: వర్షం

source: View All >
ml: എല്ലാം കാണുക >
ta: மேலும் >
te: అన్నీ చూడండి >

source: January
ml: ജനുവരി
ta: ஜனவரி
te: జనవరి

source: February
ml: ഫെബ്രുവരി
ta: பிப்ரவரி
te: ఫిబ్రవరి

source: March
ml: മാർച്ച്
ta: மார்ச்
te: మార్చి

source: April
ml: ഏപ്രിൽ
ta: ஏப்ரல்
te: ఏప్రిల్

source: May
ml: മെയ്
ta: மே
te: మే

source: June
ml: ജൂൺ
ta: ஜூன்
te: జూన్

source: July
ml: ജൂലൈ
ta: ஜூலை
te: జూలై

source: August
ml: ഓഗസ്റ്റ്
ta: ஆகஸ்ட்
te: ఆగస్టు

source: September
ml: സെപ്റ്റംബർ
ta: செப்டம்பர்
te: సెప్టెంబర్

source: October
ml: ഒക്ടോബർ
ta: அக்டோபர்
te: అక్టోబర్

source: November
ml: നവംബർ
ta: நவம்பர்
te: నవంబర్

source: December
ml: ഡിസംബർ
ta: டிசம்பர்
te: డిసెంబర్

# sunday
source: Sun
ml: ഞാ
ta: ஞா
te: ఆది

# monday
source: Mon
ml: തി
ta: தி
te: సోమ

# tuesday
source: Tue
ml: ചൊ
ta: செ
te: మంగళ

# wednesday
source: Wed
ml: ബു
ta: பு
te: బుధ

# thursday
source: Thu
ml: വ്യാ
ta: வி
te: గురు

# friday
source: Fri
ml: വെ
ta: வெ
te: శుక్ర

# saturday
source: Sat
ml: ശ
ta: ச
te: శని

source: Dark Mode
ml: ഇരുണ്ട മോഡ്
ta: இருண்ட பயன்முறை
te: డార్క్ మోడ్

source: Notifications
ml: അറിയിപ്പുകൾ
ta: அறிவிப்புகள்
te: నోటిఫికేషన్లు

source: Help & Support
ml: സഹായവും പിന്തുണയും
ta: உதவி மற்றும் ஆதரவு
te: సహాయం మరియు మద్దతు

source: About
ml: കുറിച്ച്
ta: பற்றி
te: గురించి

# helpAndSupportTitle
source: Help & Support
ml: സഹായവും പിന്തുണയും
ta: உதவி மற்றும் ஆதரவு
te: సహాయం మరియు మద్దతు

# appFeaturesTitle
source: App Features
ml: ആപ്പ് സവിശേഷതകൾ
ta: ஆப் அம்சங்கள்
te: యాప్ లక్షణాలు

# gettingStartedTitle
source: Getting Started
ml: ആരംഭിക്കുന്നത്
ta: தொடங்குவது
te: ప్రారంభించడం

# featuresAndUsageTitle
source: Features & Usage
ml: സവിശേഷതകൾ & ഉപയോഗം
ta: அம்சங்கள் மற்றும் பயன்பாடு
te: లక్షణాలు మరియు వినియోగం

# contactSupportTitle
source: Contact Support
ml: പിന്തുണയെ ബന്ധപ്പെടുക
ta: தொடர்பு ஆதரவு
te: మద్దతు సంప్రదించండి

# weatherUpdatesFeature
source: Weather Updates
ml: കാലാവസ്ഥാ അപ്ഡേറ്റുകൾ
ta: வானிலை புதுப்பிப்புகள்
te: వాతావరణ నవీకరణలు

# weatherUpdatesDesc
source: Get real-time weather information including temperature, humidity, wind speed, and 3-day forecasts to plan your farming activities.
ml: നിങ്ങളുടെ കൃഷി പ്രവർത്തനങ്ങൾ ആസൂത്രണം ചെയ്യാൻ താപനില, ആർദ്രത, കാറ്റിന്റെ വേഗത, 3-ദിവസ പ്രവചനങ്ങൾ എന്നിവ ഉൾപ്പെടെയുള്ള തത്സമയ കാലാവസ്ഥാ വിവരങ്ങൾ നേടുക.
ta: உங்கள் விவசாய நடவடிக்கைகளைத் திட்டமிட வெப்பநிலை, ஈரப்பதம், காற்றின் வேகம் மற்றும் 3-நாள் முன்னறிவிப்புகள் உள்ளிட்ட நிகழ்நேர வானிலை தகவல்களைப் பெறுங்கள்.
te: మీ కృషి కార్యకలాపాలను ప్రణాళిక చేయడానికి ఉష్ణోగ్రత, ఆర్ద్రత, గాలి వేగం మరియు 3-రోజుల అంచనాలను కలిగి ఉన్న రియల్-టైమ్ వాతావరణ సమాచారాన్ని పొందండి.

# aiChatFeature
source: HarvestBot AI Assistant
ml: HarvestBot AI അസിസ്റ്റന്റ്
ta: ஹார்வெஸ்ட்பாட் AI உதவியாளர்
te: హార్వెస్ట్ బాట్ AI సహాయకుడు

# aiChatDesc
source: Chat with our AI-powered farming expert for personalized advice, crop recommendations, and answers to your agricultural questions.
ml: വ്യക്തിഗത ഉപദേശം, വിള ശുപാർശകൾ, നിങ്ങളുടെ കാർഷിക ചോദ്യങ്ങൾക്കുള്ള ഉത്തരങ്ങൾ എന്നിവയ്ക്കായി ഞങ്ങളുടെ AI-ശക്തമായ കൃഷി വിദഗ്ധനുമായി ചാറ്റ് ചെയ്യുക.
ta: தனிப்பட்ட ஆலோசனை, பயிர் பரிந்துரைகள் மற்றும் உங்கள் விவசாய கேள்விகளுக்கான பதில்களுக்கு எங்கள் AI-இயங்கும் விவசாய நிபுணரிடம் அரட்டையடிக்கவும்.
te: వ్యక్తిగత సలహా, పంట సిఫారసులు మరియు మీ వ్యవసాయ ప్రశ్నలకు సమాధానాలు కోసం మా AI-శక్తి కలిగిన వ్యవసాయ నిపుణుడితో చాట్ చేయండి.

# pestDetectionFeature
source: Pest Detection
ml: കീടനിയന്ത്രണം
ta: பூச்சி கண்டறிதல்
te: పురుగుల గుర్తింపు

# pestDetectionDesc
source: Upload photos of your crops to identify potential pest issues and get recommendations for treatment and prevention.
ml: സാധ്യതയുള്ള കീട പ്രശ്നങ്ങൾ തിരിച്ചറിയാനും ചികിത്സയ്ക്കും പ്രതിരോധത്തിനുമായി ശുപാർശകൾ നേടാനും നിങ്ങളുടെ വിളകളുടെ ഫോട്ടോകൾ അപ്‌ലോഡ് ചെയ്യുക.
ta: சாத்தியமான பூச்சி பிரச்சினைகளைக் கண்டறிந்து சிகிச்சை மற்றும் தடுப்புக்கான பரிந்துரைகளைப் பெற உங்கள் பயிர்களின் புகைப்படங்களைப் பதிவேற்றவும்.
te: సంభావ్య పురుగుల సమస్యలను గుర్తించడానికి మరియు చికిత్స మరియు నివారణకు సిఫారసులు పొందడానికి మీ పంటల ఫోటోలను అప్‌లోడ్ చేయండి.

# communityFeature
source: Farming Community
ml: കൃഷി സമൂഹം
ta: விவசாய சமூகம்
te: వ్యవసాయ సమూహం

# communityDesc
source: Connect with fellow farmers, share experiences, ask questions, and learn from the farming community.
ml: സഹ കർഷകരുമായി ബന്ധപ്പെടുക, അനുഭവങ്ങൾ പങ്കിടുക, ചോദ്യങ്ങൾ ചോദിക്കുക, കൃഷി സമൂഹത്തിൽ നിന്ന് പഠിക്കുക.
ta: சக விவசாயிகளுடன் இணைக்கவும், அனுபவங்களைப் பகிரவும், கேள்விகள் கேட்கவும் மற்றும் விவசாய சமூகத்திலிருந்து கற்றுக்கொள்ளவும்.
te: ఇతర రైతులతో కనెక్ట్ అవ్వండి, అనుభవాలను పంచుకోండి, ప్రశ్నలు అడగండి మరియు వ్యవసాయ సమూహం నుండి నేర్చుకోండి.

# multiLanguageFeature
source: Multi-Language Support
ml: ബഹുഭാഷാ പിന്തുണ
ta: பல மொழி ஆதரவு
te: బహుభాషా మద్దతు

# multiLanguageDesc
source: Use the app in your preferred language with support for English, Hindi, Tamil, Telugu, and Malayalam.
ml: ഇംഗ്ലീഷ്, ഹിന്ദി, തമിഴ്, തെലുങ്ക്, മലയാളം എന്നിവയുടെ പിന്തുണയോടെ നിങ്ങളുടെ ഇഷ്ട ഭാഷയിൽ ആപ്പ് ഉപയോഗിക്കുക.
ta: ஆங்கிலம், இந்தி, தமிழ், தெலுங்கு மற்றும் மலையாளம் ஆதரவுடன் உங்கள் விருப்பமான மொழியில் ஆப்ஸைப் பயன்படுத்தவும்.
te: ఆంగ్లం, హిందీ, తమిళం, తెలుగు మరియు మలయాళం వంటి మీ ఇష్టమైన భాషలో యాప్‌ను ఉపయోగించండి.

# profileManagementFeature
source: Profile Management
ml: പ്രൊഫൈൽ മാനേജ്മെന്റ്
ta: சுயவிவர மேலாண்மை
te: ప్రొఫైల్ నిర్వహణ

# profileManagementDesc
source: Manage your personal information, crop preferences, and location settings for personalized recommendations.
ml: വ്യക്തിഗത ശുപാർശകൾക്കായി നിങ്ങളുടെ വ്യക്തിഗത വിവരങ്ങൾ, വിള മുൻഗണനകൾ, സ്ഥാന ക്രമീകരണങ്ങൾ എന്നിവ കൈകാര്യം ചെയ്യുക.
ta: தனிப்பயனாக்கப்பட்ட பரிந்துரைகளுக்காக உங்கள் தனிப்பட்ட தகவல், பயிர் விருப்பத்தேர்வுகள் மற்றும் இருப்பிட அமைப்புகளை நிர்வகிக்கவும்.
te: వ్యక్తిగత సమాచారం, పంట ప్రాధాన్యతలు మరియు వ్యక్తిగతీకరించిన సిఫారసుల కోసం స్థానం సెట్టింగ్‌లను నిర్వహించండి.

# gettingStartedStep1
source: 1. Set up your profile with your location and crop preferences
ml: 1. നിങ്ങളുടെ സ്ഥാനവും വിള മുൻഗണനകളും ഉപയോഗിച്ച് നിങ്ങളുടെ പ്രൊഫൈൽ സജ്ജമാക്കുക
ta: 1. உங்கள் இருப்பிடம் மற்றும் பயிர் விருப்பத்தேர்வுகளுடன் உங்கள் சுயவிவரத்தை அமைக்கவும்
te: 1. మీ స్థానం మరియు పంట ప్రాధాన్యతలతో మీ ప్రొఫైల్‌ను సెట్అప్ చేయండి

# gettingStartedStep2
source: 2. Allow location access for accurate weather updates
ml: 2. കൃത്യമായ കാലാവസ്ഥാ അപ്ഡേറ്റുകൾക്കായി സ്ഥാന ആക്സസ് അനുവദിക്കുക
ta: 2. துல்லியமான வானிலை புதுப்பிப்புகளுக்கு இருப்பிட அணுகலை அனுமதிக்கவும்
te: 2. ఖచ్చితమైన వాతావరణ నవీకరణల కోసం స్థానం యాక్సెస్‌ను అనుమతించండి

# gettingStartedStep3
source: 3. Explore weather forecasts and farming insights on the home screen
ml: 3. ഹോം സ്ക്രീനിൽ കാലാവസ്ഥാ പ്രവചനങ്ങളും കൃഷി ഉൾക്കാഴ്ചകളും പര്യവേക്ഷണം ചെയ്യുക
ta: 3. முகப்பு திரையில் வானிலை முன்னறிவிப்புகள் மற்றும் விவசாய நுண்ணறிவுகளை ஆராயுங்கள்
te: 3. హోమ్ స్క్రీన్‌లో వాతావరణ అంచనాలు మరియు వ్యవసాయ అంతర్దృష్టులను అన్వేషించండి

# gettingStartedStep4
source: 4. Chat with HarvestBot for personalized farming advice
ml: 4. വ്യക്തിഗത കൃഷി ഉപദേശത്തിനായി HarvestBot-മായി ചാറ്റ് ചെയ്യുക
ta: 4. தனிப்பயனாக்கப்பட்ட விவசாய ஆலோசனைக்காக ஹார்வெஸ்ட்பாட்டுடன் அரட்டையடிக்கவும்
te: 4. వ్యక్తిగతీకరించిన వ్యవసాయ సలహా కోసం హార్వెస్ట్‌బాట్‌తో చాట్ చేయండి

# gettingStartedStep5
source: 5. Join the community to connect with other farmers
ml: 5. മറ്റ് കർഷകരുമായി ബന്ധപ്പെടാൻ സമൂഹത്തിൽ ചേരുക
ta: 5. மற்ற விவசாயிகளுடன் இணைவதற்கு சமூகத்தில் சேரவும்
te: 5. ఇతర రైతులతో కనెక్ట్ అవ్వడానికి సమూహంలో చేరండి

# weatherUsageTitle
source: Using Weather Features
ml: കാലാവസ്ഥാ സവിശേഷതകൾ ഉപയോഗിക്കുന്നത്
ta: வானிலை அம்சங்களைப் பயன்படுத்துதல்
te: వాతావరణ లక్షణాలను ఉపయోగించడం

# weatherUsageDesc
source: View current weather conditions, 3-day forecasts, and 30-day extended forecasts. Tap 'View All' to see detailed calendar view.
ml: നിലവിലെ കാലാവസ്ഥാ അവസ്ഥകൾ, 3-ദിവസ പ്രവചനങ്ങൾ, 30-ദിവസ വിപുലീകൃത പ്രവചനങ്ങൾ എന്നിവ കാണുക. വിശദമായ കലണ്ടർ കാഴ്ച കാണാൻ 'എല്ലാം കാണുക' ടാപ്പ് ചെയ്യുക.
ta: தற்போதைய வானிலை நிலைமைகள், 3-நாள் முன்னறிவிப்புகள் மற்றும் 30-நாள் நீட்டிக்கப்பட்ட முன்னறிவிப்புகளைக் காண்க. விரிவான காலண்டர் பார்வையைக் காண 'அனைத்தையும் காண்க' என்பதைத் தட்டவும்.
te: ప్రస్తుత వాతావరణ పరిస్థితులు, 3-రోజుల అంచనాలు మరియు 30-రోజుల విస్తృత అంచనాలను చూడండి. వివరమైన క్యాలెండర్ వీక్షణ కోసం 'అన్నీ చూడండి'పై నొక్కండి.

# aiChatUsageTitle
source: Using HarvestBot
ml: HarvestBot ഉപയോഗിക്കുന്നത്
ta: ஹார்வெஸ்ட்பாட்டைப் பயன்படுத்துதல்
te: హార్వెస్ట్‌బాట్ ఉపయోగించడం

# aiChatUsageDesc
source: Ask questions about crops, diseases, fertilizers, or any farming topic. The AI provides context-aware responses based on your conversation.
ml: വിളകൾ, രോഗങ്ങൾ, വളങ്ങൾ, അല്ലെങ്കിൽ ഏതെങ്കിലും കൃഷി വിഷയത്തെക്കുറിച്ച് ചോദ്യങ്ങൾ ചോദിക്കുക. AI നിങ്ങളുടെ സംഭാഷണത്തെ അടിസ്ഥാനമാക്കി സന്ദർഭ-അവബോധമുള്ള മറുപടികൾ നൽകുന്നു.
ta: பயிர்கள், நோய்கள், உரங்கள் அல்லது ஏதேனும் விவசாய தலைப்பு பற்றி கேள்விகள் கேளுங்கள். AI உங்கள் உரையாடலின் அடிப்படையில் சூழல்-விழிப்புணர்வு பதில்களை வழங்குகிறது.
te: పంటలు, వ్యాధులు, ఎరువులు లేదా ఏదైనా వ్యవసాయ అంశం గురించి ప్రశ్నలు అడగండి. మీ సంభాషణ ఆధారంగా AI సందర్భానుసారమైన సమాధానాలను ఇస్తుంది.

# pestDetectionUsageTitle
source: Using Pest Detection
ml: കീടനിയന്ത്രണം ഉപയോഗിക്കുന്നത്
ta: பூச்சி கண்டறிதலைப் பயன்படுத்துதல்
te: పురుగుల గుర్తింపు ఉపయోగించడం

# pestDetectionUsageDesc
source: Take clear photos of affected plants. The system will analyze and provide identification and treatment recommendations.
ml: ബാധിച്ച ചെടികളുടെ വ്യക്തമായ ഫോട്ടോകൾ എടുക്കുക. സിസ്റ്റം വിശകലനം ചെയ്ത് തിരിച്ചറിയലും ചികിത്സാ ശുപാർശകളും നൽകും.
ta: பாதிக்கப்பட்ட தாவரங்களின் தெளிவான புகைப்படங்களை எடுக்கவும். கணினி பகுப்பாய்வு செய்து அடையாளம் மற்றும் சிகிச்சை பரிந்துரைகளை வழங்கும்.
te: బాధిత మొక్కల స్పష్టమైన ఫోటోలు తీయండి. వ్యవస్థ విశ్లేషించి గుర్తింపు మరియు చికిత్స సిఫారసులు ఇస్తుంది.

# communityUsageTitle
source: Using Community Features
ml: സമൂഹ സവിശേഷതകൾ ഉപയോഗിക്കുന്നത്
ta: சமூக அம்சங்களைப் பயன்படுத்துதல்
te: సమూహ లక్షణాలను ఉపయోగించడం

# communityUsageDesc
source: Share posts, photos, and experiences. Comment on others' posts and build connections with fellow farmers.
ml: പോസ്റ്റുകൾ, ഫോട്ടോകൾ, അനുഭവങ്ങൾ എന്നിവ പങ്കിടുക. മറ്റുള്ളവരുടെ പോസ്റ്റുകളിൽ അഭിപ്രായം രേഖപ്പെടുത്തുകയും സഹ കർഷകരുമായി ബന്ധം സ്ഥാപിക്കുകയും ചെയ്യുക.
ta: இடுகைகள், புகைப்படங்கள் மற்றும் அனுபவங்களைப் பகிரவும். மற்றவர்களின் இடுகைகளில் கருத்து தெரிவித்து சக விவசாயிகளுடன் தொடர்புகளை உருவாக்குங்கள்.
te: పోస్టులు, ఫోటోలు, అనుభవాలను పంచుకోండి. ఇతరుల పోస్టులపై వ్యాఖ్యానించండి మరియు రైతులతో సంబంధాలు నిర్మించండి.

# troubleshootingTitle
source: Troubleshooting
ml: പ്രശ്നപരിഹാരം
ta: சரிசெய்தல்
te: సమస్య పరిష్కారం

source: Location Issues
ml: സ്ഥാന പ്രശ്നങ്ങൾ
ta: இருப்பிட பிரச்சினைகள்
te: స్థానం సమస్యలు

# locationIssuesDesc
source: Ensure location services are enabled in your device settings for accurate weather data.
ml: കൃത്യമായ കാലാവസ്ഥാ ഡാറ്റയ്ക്കായി നിങ്ങളുടെ ഉപകരണ ക്രമീകരണങ്ങളിൽ സ്ഥാന സേവനങ്ങൾ പ്രവർത്തനക്ഷമമാക്കിയിട്ടുണ്ടെന്ന് ഉറപ്പാക്കുക.
ta: துல்லியமான வானிலை தரவுக்காக உங்கள் சாதன அமைப்புகளில் இருப்பிட சேவைகள் இயக்கப்பட்டுள்ளன என்பதை உறுதிப்படுத்தவும்.
te: ఖచ్చితమైన వాతావరణ డేటా కోసం మీ డివైస్ సెట్టింగ్స్‌లో స్థానం సేవలు ప్రారంభించండి.

source: Weather Not Loading
ml: കാലാവസ്ഥ ലോഡ് ചെയ്യുന്നില്ല
ta: வானிலை ஏற்றப்படவில்லை
te: వాతావరణం లోడ్ కావడంలేదు

# weatherNotLoadingDesc
source: Check your internet connection and location permissions. Pull down to refresh the home screen.
ml: നിങ്ങളുടെ ഇന്റർനെറ്റ് കണക്ഷനും സ്ഥാന അനുമതികളും പരിശോധിക്കുക. ഹോം സ്ക്രീൻ പുതുക്കാൻ താഴേക്ക് വലിക്കുക.
ta: உங்கள் இணைய இணைப்பு மற்றும் இருப்பிட அனுமதிகளைச் சரிபார்க்கவும். முகப்பு திரையை புதுப்பிக்க கீழே இழுக்கவும்.
te: మీ ఇంటర్నెట్ కనెక్షన్ మరియు స్థానం అనుమతులను తనిఖీ చేయండి. హోమ్ స్క్రీన్‌ను రిఫ్రెష్ చేయడానికి క్రిందికి లాగండి.

source: AI Not Responding
ml: AI പ്രതികരിക്കുന്നില്ല
ta: AI பதிலளிக்கவில்லை
te: AI స్పందించడంలేదు

# aiNotRespondingDesc
source: Ensure you have a stable internet connection. Try rephrasing your question if the AI doesn't understand.
ml: നിങ്ങൾക്ക് സുസ്ഥിരമായ ഇന്റർനെറ്റ് കണക്ഷൻ ഉണ്ടെന്ന് ഉറപ്പാക്കുക. AI മനസ്സിലാകുന്നില്ലെങ്കിൽ നിങ്ങളുടെ ചോദ്യം പുനർനിർമ്മിക്കാൻ ശ്രമിക്കുക.
ta: உங்களிடம் நிலையான இணைய இணைப்பு உள்ளது என்பதை உறுதிப்படுத்தவும். AI புரிந்துகொள்ளவில்லை என்றால் உங்கள் கேள்வியை மீண்டும் வடிவமைக்க முயற்சிக்கவும்.
te: స్థిరమైన ఇంటర్నెట్ కనెక్షన్ ఉందో లేదో చూసుకోండి. AI అర్థం కాకపోతే మీ ప్రశ్నను మళ్లీ అడగండి.

# contactSupportDesc
source: For additional help or to report issues, you can:
ml: കൂടുതൽ സഹായത്തിനോ പ്രശ്നങ്ങൾ റിപ്പോർട്ട് ചെയ്യാനോ, നിങ്ങൾക്ക്:
ta: கூடுதல் உதவிக்காக அல்லது சிக்கல்களைப் புகாரளிக்க, நீங்கள் செய்யலாம்:
te: అదనపు సహాయం లేదా సమస్యలు నివేదించడానికి, మీరు చేయవచ్చు:

# emailSupport
source: Email us at: support@harvesthub.com
ml: ഞങ്ങളെ ഇമെയിൽ ചെയ്യുക: support@harvesthub.com
ta: எங்களுக்கு மின்னஞ்சல் அனுப்புங்கள்: support@harvesthub.com
te: మాకు ఈమెయిల్ చేయండి: support@harvesthub.com

# reportIssue
source: Report issues through the app feedback
ml: ആപ്പ് ഫീഡ്ബാക്ക് വഴി പ്രശ്നങ്ങൾ റിപ്പോർട്ട് ചെയ്യുക
ta: ஆப் கருத்து மூலம் சிக்கல்களைப் புகாரளிக்கவும்
te: యాప్ ఫీడ్‌బ్యాక్ ద్వారా సమస్యలను నివేదించండి

# visitWebsite
source: Visit our website: www.harvesthub.com
ml: ഞങ്ങളുടെ വെബ്സൈറ്റ് സന്ദർശിക്കുക: www.harvesthub.com
ta: எங்கள் வலைத்தளத்தைப் பார்வையிடவும்: www.harvesthub.com
te: మా వెబ్‌సైట్ సందర్శించండి: www.harvesthub.com

# appVersion
source: App Version: 1.5.0
ml: ആപ്പ് പതിപ്പ്: 1.5.0
ta: ஆப் பதிப்பு: 2.0.1
te: యాప్ వెర్షన్: 1.5.0

# lastUpdated
source: Last Updated: June 2025
ml: അവസാനമായി അപ്ഡേറ്റ് ചെയ്തത്: ജൂൺ 2025
ta: கடைசியாக புதுப்பிக்கப்பட்டது: ஜூன் 2025
te: చివరిగా నవీకరించబడింది: జూన్ 2025

source: Upload Plant Image
ml: ചെടിയുടെ ചിത്രം അപ്‌ലോഡ് ചെയ്യുക
ta: தாவர படத்தை பதிவேற்றவும்
te: మొక్క చిత్రాన్ని అప్‌లోడ్ చేయండి

# uploadPlantImageDesc
source: Take a clear photo of your plant leaves or upload from gallery to detect pests and diseases.
ml: കീടങ്ങളെയും രോഗങ്ങളെയും കണ്ടെത്താൻ ചെടിയുടെ ഇലകളുടെ വ്യക്തമായ ഫോട്ടോ എടുക്കുകയോ ഗാലറിയിൽ നിന്ന് അപ്‌ലോഡ് ചെയ്യുകയോ ചെയ്യുക.
ta: கீடுகள் மற்றும் நோய்களைக் கண்டறிய உங்கள் தாவர இலைகளின் தெளிவான புகைப்படம் எடுக்கவும் அல்லது கேலரியிலிருந்து பதிவேற்றவும்.
te: పురుగులు మరియు వ్యాధులను గుర్తించడానికి మొక్క ఆకుల స్పష్టమైన ఫోటో తీయండి లేదా గ్యాలరీ నుండి అప్‌లోడ్ చేయండి.

source: Camera
ml: ക്യാമറ
ta: கேமரா
te: కెమెరా

source: Gallery
ml: ഗാലറി
ta: கேலரி
te: గ్యాలరీ

source: Analyzing...
ml: വിശകലനം ചെയ്യുന്നു...
ta: பகுப்பாய்வு செய்கிறது...
te: విశ్లేషిస్తోంది...

source: Analyze Image
ml: ചിത്രം വിശകലനം ചെയ്യുക
ta: படத்தை பகுப்பாய்வு செய்
te: చిత్రాన్ని విశ్లేషించండి

source: Detection Results
ml: കണ്ടെത്തൽ ഫലങ്ങൾ
ta: கண்டறிதல் முடிவுகள்
te: గుర్తింపు ఫలితాలు

source: No image selected
ml: ചിത്രം തിരഞ്ഞെടുത്തിട്ടില്ല
ta: படம் தேர்ந்தெடுக்கப்படவில்லை
te: చిత్రం ఎంచుకోబడలేదు

# uploadImageToGetStarted
source: Upload an image to get started
ml: ആരംഭിക്കാൻ ഒരു ചിത്രം അപ്‌ലോഡ് ചെയ്യുക
ta: தொடங்க ஒரு படத்தை பதிவேற்றவும்
te: ప్రారంభించడానికి చిత్రాన్ని అప్‌లోడ్ చేయండి

source: Analysis Complete
ml: വിശകലനം പൂർത്തിയായി
ta: பகுப்பாய்வு முடிந்தது
te: విశ్లేషణ పూర్తయింది

# noPestsDetected
source: No pests detected in this image
ml: ഈ ചിത്രത്തിൽ കീടങ്ങളൊന്നും കണ്ടെത്തിയില്ല
ta: இந்த படத்தில் கீடுகள் எதுவும் கண்டறியப்படவில்லை
te: ఈ చిత్రంలో పురుగులు గుర్తించబడలేదు

# cropsHealthyMessage
source: Your crops appear healthy! Continue with regular monitoring and maintain good agricultural practices.
ml: നിങ്ങളുടെ വിളകൾ ആരോഗ്യകരമായി കാണപ്പെടുന്നു! പതിവ് നിരീക്ഷണം തുടരുകയും നല്ല കാർഷിക രീതികൾ നിലനിർത്തുകയും ചെയ്യുക.
ta: உங்கள் பயிர்கள் ஆரோக்கியமாக தெரிகின்றன! வழக்கமான கண்காணிப்பைத் தொடரவும் மற்றும் நல்ல விவசாய நடைமுறைகளை பராமரிக்கவும்.
te: మీ పంటలు ఆరోగ్యంగా కనిపిస్తున్నాయి! రెగ్యులర్ మానిటరింగ్ కొనసాగించండి మరియు మంచి వ్యవసాయ పద్ధతులను కొనసాగించండి.

source: Recommendations
ml: ശുപാർശകൾ
ta: பரிந்துரைகள்
te: సిఫారసులు

source: Ready to analyze
ml: വിശകലനത്തിന് തയ്യാർ
ta: பகுப்பாய்வு செய்ய தயார்
te: విశ్లేషించడానికి సిద్ధం

# uploadImageAndAnalyze
source: Upload an image and tap "Analyze" to detect pests and get recommendations
ml: ചിത്രം അപ്‌ലോഡ് ചെയ്ത് കീടങ്ങളെ കണ്ടെത്താനും ശുപാർശകൾ നേടാനും "വിശകലനം ചെയ്യുക" ടാപ്പ് ചെയ്യുക
ta: படத்தை பதிவேற்றி கீடுகளைக் கண்டறிந்து பரிந்துரைகளைப் பெற "பகுப்பாய்வு" என்பதைத் தட்டவும்
te: చిత్రాన్ని అప్‌లోడ్ చేసి పురుగులను గుర్తించడానికి మరియు సిఫారసులు పొందడానికి "విశ్లేషించండి"పై టాప్ చేయండి

source: How to use
ml: എങ്ങനെ ഉപയോഗിക്കാം
ta: எப்படி பயன்படுத்துவது
te: ఎలా ఉపయోగించాలి

# takeClearPhotos
source: Take clear, well-lit photos of plant leaves
ml: ചെടിയുടെ ഇലകളുടെ വ്യക്തമായ, നന്നായി പ്രകാശമുള്ള ഫോട്ടോകൾ എടുക്കുക
ta: தாவர இலைகளின் தெளிவான, நன்கு ஒளிரும் புகைப்படங்களை எடுக்கவும்
te: మొక్క ఆకుల స్పష్టమైన, బాగా వెలుగుతున్న ఫోటోలు తీయండి

# focusOnAffectedAreas
source: Focus on affected areas with visible symptoms
ml: ദൃശ്യമായ ലക്ഷണങ്ങളുള്ള ബാധിത പ്രദേശങ്ങളിൽ ശ്രദ്ധ കേന്ദ്രീകരിക്കുക
ta: தெரியும் அறிகுறிகளுடன் பாதிக்கப்பட்ட பகுதிகளில் கவனம் செலுத்துங்கள்
te: కనిపించే లక్షణాలతో ప్రభావిత ప్రాంతాలపై దృష్టి పెట్టండి

# avoidBlurryImages
source: Avoid blurry or dark images
ml: അവ്യക്തമായതോ ഇരുണ്ടതോ ആയ ചിത്രങ്ങൾ ഒഴിവാക്കുക
ta: மங்கலான அல்லது இருண்ட படங்களைத் தவிர்க்கவும்
te: అస్పష్టమైన లేదా చీకటి చిత్రాలను నివారించండి

# includeMultipleLeaves
source: Include multiple leaves if possible
ml: സാധ്യമെങ്കിൽ ഒന്നിലധികം ഇലകൾ ഉൾപ്പെടുത്തുക
ta: முடிந்தால் பல இலைகளைச் சேர்க்கவும்
te: వీలైతే అనేక ఆకులను చేర్చండి

source: Got it
ml: മനസ്സിലായി
ta: புரிந்தது
te: అర్థమైంది
